package com.lightwave.activities_intent_codingchallenge;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.util.Log;
import android.view.View;

public class MainActivity extends AppCompatActivity {

    private static final String logCat = MainActivity.class.getSimpleName();
    public static final String EXTRA_MSG_REQUEST = "extra.MESSAGE.REQUEST";

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
    }

    public void buttonOneMsg(View view) {
        Log.d(logCat,"Button 1 clicked!!");
        Intent intent = new Intent(this,SecondActivity.class);
        String message1 = "“प्रासादों के कनकाभ शिखर,\n" +
                "होते कबूतरों के ही घर,\n" +
                "महलों में गरुड़ ना होता है,\n" +
                "कंचन पर कभी न सोता है.\n" +
                "रहता वह कहीं पहाड़ों में,\n" +
                "शैलों की फटी दरारों में.\n" +
                "\n" +
                "होकर सुख-समृद्धि के अधीन,\n" +
                "मानव होता निज तप क्षीण,\n" +
                "सत्ता किरीट मणिमय आसन,\n" +
                "करते मनुष्य का तेज हरण.\n" +
                "नर वैभव हेतु लालचाता है,\n" +
                "पर वही मनुज को खाता है.\n" +
                "\n" +
                "चाँदनी पुष्प-छाया मे पल,\n" +
                "नर भले बने सुमधुर कोमल,\n" +
                "पर अमृत क्लेश का पिए बिना,\n" +
                "आताप अंधड़ में जिए बिना,\n" +
                "वह पुरुष नही कहला सकता,\n" +
                "विघ्नों को नही हिला सकता.\n" +
                "\n" +
                "उड़ते जो झंझावतों में,\n" +
                "पीते जो वारि प्रपातो में,\n" +
                "सारा आकाश अयन जिनका,\n" +
                "विषधर भुजंग भोजन जिनका,\n" +
                "वे ही फानिबंध छुड़ाते हैं,\n" +
                "धरती का हृदय जुड़ाते हैं.”\n" +
                "― Ramdhari Singh Dinkar, रश्मिरथी";
        intent.putExtra(EXTRA_MSG_REQUEST,message1);
        startActivity(intent);

    }

    public void buttonTwoMsg(View view) {
        Log.d(logCat,"Button 2 clicked!!");
        Intent intent2 = new Intent(this,SecondActivity.class);
        String message2 = "“यादों के क़िस्से।\n" +
                "\n" +
                "ऐसे तो तेरे जुदा होने के पलों में भी मेरे दिल की सांसें ऊपर नीचे होती रहती है\n" +
                "लेकिन मिलने की ख़ुशी में कितनी बेचैन रहती हूँ ये तुम्हें भी पता है\n" +
                "लेकिन सच कहूँ तो तुमसे ज़्यादा तुम्हारी यादों में रहना अच्छा लगता है , क्योंकि जब भी मिलते है तब थोड़े ही पलों में जुदा हो जाते हैं।\n" +
                "वहीं तुम्हारी याद मेरे हर पल में मेरा साथ देती है।\n" +
                "तुम्हारी याद मेरे लिए ताजगी होती हैं।\n" +
                "तुम्हारी याद मेरी साँस है।\n" +
                "तुम्हारी याद मेरी ज़िंदगी की उदास पलों में भी मुझे हँसने का बहाना देती है।\n" +
                "हर पल लगता है की तु मेरे कहीं आस पास हो।\n" +
                "खुली आँखों से दिखता है ये सपना सच है या फिर तुम कोई आभास हो ।\n" +
                "\n" +
                "लेकिन सच तो यही है कि हक़ीक़त हो या आभास जो भी है मुझे बोहोत पसंद है।\n" +
                "क्योंकि इस सपने में तू ही तू है।\n" +
                "लोग कहते हैं कि नींद का आना क़ुदरत का वरदान है और नींद न आना अभिशाप है ।\n" +
                "लेकिन अगर मुझे जो तुम्हारी याद की हर एक पल में जीने की इजाज़त मिले , तो मैं कर दूँ नींद को भी अपने आप से परे।\n" +
                "और खोई रहूँ तुम्हारे ही सपनों में।\n" +
                "\n" +
                "अब हर एक मौसम भी करवट बदल रहा है , क्योंकि इस महके हुए आकाश में भी तेरा अंश कही छलक रहा है।\n" +
                "जानते हो कहीं न कहीं तुम्हारी वो मुस्कान को अपनी नींद में लेकर मैं सोती हूँ ।ऐसे ही तो तुम मेरे सपनों में आकर मेरी साँसों को भी नई धड़कन दे कर जाते हो।\n" +
                "बस तुम्हारा नाम लिखा ही था कि मेरी आंखें भर आयी है आगे\n" +
                "के कैसे लिखूँ मैं अपनी यादों की कविता, कैसे उतारू मैं अपनी क़लम के काग़ज़ के आगे।\n" +
                "सुख के सारे वो पल लिखूं\n" +
                "या जुदाई के सारे वो ग़म लिखूँ।\n" +
                "जुदाई कि वो हर पल लिखना चाहूँ ,तब दिल मेरा हाथ रोके\n" +
                "बार बार अक्षरों को मिटाते हुए हो गया मेरा काग़ज़ भी पूरा , और कहें मुझ से क्यों न लिख पाए तुम अपने जुदाई वाले यादों के क़िस्से।\n" +
                "अब जब लिखा नाम तुम्हारा कहीं\n" +
                "तो महेक उठा मेरा कागज़ भी पुराना अभी ।\n" +
                "जैसे ही सपनों में आया हो अलग सा ही उजाला कहीं।\n" +
                "\n" +
                "आख़िरी रास्ता बन के मिल मुझे\n" +
                "बस एक तू ही है आधार ये भी तो पता है तुम्हें\n" +
                "जान ले तू ये समय की हर चाल को\n" +
                "बस मेरी ज़िंदगी के हर एक पल में बसा है तू मेरी धड़कन बन के।”";
        intent2.putExtra(EXTRA_MSG_REQUEST,message2);
        startActivity(intent2);
    }

    public void buttonThreeMsg(View view) {
        Log.d(logCat,"Button 3 clicked!!");
        Intent intent3 = new Intent(this,SecondActivity.class);
        String message3 = "“अच्छा! ठीक तो फिर मैं एक कविता सुनाता हूँ। अगर तुम कविता सुनते हुए हँस दिए तो सात दिन लगातार नहाना पड़ेगा। बोलो मंजूर”, मैंने शरारत से कहा।\n" +
                "\n" +
                "“कविता सुन के कौन हँसता है। बंडल-बोर होती है कविता”, वह बोला।\n" +
                "“ठीक है फिर सुनो। बच्चू”, मैंने कहा।\n" +
                "“हल्लम हल्लम हौदा, हाथी चल्लम चल्लम\n" +
                "हम बैठे हाथी पर, हाथी हल्लम हल्लम\n" +
                "लंबी लंबी सूँड़ फटाफट फट्\u200Cटर फट्\u200Cटर\n" +
                "लंबे लंबे दाँत खटाखट खट्\u200Cटर खट्\u200Cटर\n" +
                "भारी भारी मूँड़ मटकता झम्मम झम्मम\n" +
                "हल्लम हल्लम हौदा, हाथी चल्लम चल्लम\n" +
                "पर्वत जैसी देह थुलथुली थल्लल थल्लल\n" +
                "हालर हालर देह हिले जब हाथी चल्लल।”";
        intent3.putExtra(EXTRA_MSG_REQUEST,message3);
        startActivity(intent3);
    }
}
